rule  Dev_sigma_powershell_rundll32_remote_thread_creation {
 meta:
    author = "Florian Roth"
    description = "Detects PowerShell remote thread creation in Rundll32.exe Author: Florian Roth."
    reference = ""
    version = "0.01"
    created = "2018/06/25"
    product = "windows"
    category = "create_remote_thread"
    mitre = "defense_evasion, execution, t1085, t1218.011, t1086, t1059.001"

  events:
($selection.metadata.product_event_type = "8" and re.regex($selection.src.process.file.full_path, `.*\\powershell\.exe`) and re.regex($selection.target.process.file.full_path, `.*\\rundll32\.exe`))

  condition:
    $selection
}
