rule  Dev_sigma_createminidump_hacktool {
 meta:
    author = "Florian Roth"
    description = "Detects the use of CreateMiniDump hack tool used to dump the LSASS process memory for credential extraction on the attacker's machine Author: Florian Roth."
    reference = ""
    version = "0.01"
    created = "2019/12/22"
    category = "process_creation"
    product = "windows"
    mitre = "credential_access, t1003.001, t1003"

  events:
(re.regex($selection1.target.process.file.full_path, `.*\\CreateMiniDump\.exe.*`) or $selection1.target.file.md5 = "4a07f944a83e8a7c2525efa35dd30e2f")

  condition:
    $selection1
}
rule  Dev_sigma_createminidump_hacktool_part_1 {
 meta:
    author = "Florian Roth"
    description = "Detects the use of CreateMiniDump hack tool used to dump the LSASS process memory for credential extraction on the attacker's machine Author: Florian Roth."
    reference = ""
    version = "0.01"
    created = "2019/12/22"
    product = "windows"
    category = "file_event"
    mitre = "credential_access, t1003.001, t1003"

  events:
($selection.metadata.product_event_type = "11" and re.regex($selection.target.file.full_path, `.*\\lsass\.dmp`))

  condition:
    $selection
}
