rule  Dev_sigma_psexec_tool_execution {
 meta:
    author = "Thomas Patzke"
    description = "Detects PsExec service installation and execution events (service and Sysmon) Author: Thomas Patzke."
    reference = ""
    version = "0.01"
    created = "2017/06/12"
    product = "windows"
    service = "system"
    mitre = "execution, t1035, t1569.002, s0029"

  events:
($service_installation.target.process.command_line = "PSEXESVC" and (($service_installation.metadata.product_event_type = "7045" and re.regex($service_installation.target.process.command_line, `.*\\PSEXESVC\.exe`)) or $service_installation.metadata.product_event_type = "7036"))

  condition:
    $service_installation
}
rule  Dev_sigma_psexec_tool_execution_part_1 {
 meta:
    author = "Thomas Patzke"
    description = "Detects PsExec service installation and execution events (service and Sysmon) Author: Thomas Patzke."
    reference = ""
    version = "0.01"
    created = "2017/06/12"
    category = "process_creation"
    product = "windows"
    mitre = "execution, t1035, t1569.002, s0029"

  events:
(re.regex($sysmon_processcreation.target.process.file.full_path, `.*\\PSEXESVC\.exe`) and $sysmon_processcreation.src.user.user_display_name = "NT AUTHORITY\\SYSTEM")

  condition:
    $sysmon_processcreation
}
rule  Dev_sigma_psexec_tool_execution_part_2 {
 meta:
    author = "Thomas Patzke"
    description = "Detects PsExec service installation and execution events (service and Sysmon) Author: Thomas Patzke."
    reference = ""
    version = "0.01"
    created = "2017/06/12"
    category = "pipe_created"
    product = "windows"
    mitre = "execution, t1035, t1569.002, s0029"

  events:
$sysmon_pipecreated.file.name = "PSEXESVC"

  condition:
    $sysmon_pipecreated
}
rule  Dev_sigma_psexec_tool_execution_part_3 {
 meta:
    author = "Thomas Patzke"
    description = "Detects PsExec service installation and execution events (service and Sysmon) Author: Thomas Patzke."
    reference = ""
    version = "0.01"
    created = "2017/06/12"
    category = "file_event"
    product = "windows"
    mitre = "execution, t1035, t1569.002, s0029"

  events:
re.regex($sysmon_filecreation.target.file.full_path, `.*\\PSEXESVC\.exe`)

  condition:
    $sysmon_filecreation
}
