rule  Dev_sigma_windows_defender_threat_detected {
 meta:
    author = "Ján Trenčanský"
    description = "Detects all actions taken by Windows Defender malware detection engines Author: Ján Trenčanský."
    reference = ""
    version = "0.01"
    created = "2020/07/28"
    product = "windows"
    service = "windefend"

  events:
($selection.metadata.product_event_type = "1006" or $selection.metadata.product_event_type = "1116" or $selection.metadata.product_event_type = "1015" or $selection.metadata.product_event_type = "1117")

  condition:
    $selection
}
