rule  Dev_sigma_rclone_config_file_creation {
 meta:
    author = "Aaron Greetham (@beardofbinary) - NCC Group"
    description = "Detects Rclone config file being created Author: Aaron Greetham (@beardofbinary) - NCC Group."
    reference = ""
    version = "0.01"
    created = "2021/05/26"
    product = "windows"
    category = "file_event"
    mitre = "exfiltration, t1567.002"

  events:
($file_selection.metadata.product_event_type = "11" and re.regex($file_selection.target.file.full_path, `C:\\Users.*\\\.config\\rclone.*`))

  condition:
    $file_selection
}
