rule  Dev_sigma_disabling_windows_event_auditing {
 meta:
    author = "@neu5ron"
    description = "Detects scenarios where system auditing (ie: windows event log auditing) is disabled. This may be used in a scenario where an entity would want to bypass local logging to evade detection when windows event logging is enabled and reviewed. Also, it is recommended to turn off \"Local Group Policy Object Processing\" via GPO, which will make sure that Active Directory GPOs take precedence over local/edited computer policies via something such as \"gpedit.msc\". Please note, that disabling \"Local Group Policy Object Processing\" may cause an issue in scenarios of one off specific GPO modifications -- however it is recommended to perform these modifications in Active Directory anyways. Author: @neu5ron."
    reference = ""
    version = "0.01"
    created = "2017/11/19"
    product = "windows"
    service = "security"
    mitre = "defense_evasion, t1054, t1562.002"

  events:
($selection.metadata.product_event_type = "4719" and (re.regex($selection.AuditPolicyChanges, `.*%%8448.*`) or re.regex($selection.AuditPolicyChanges, `.*%%8450.*`)))

  condition:
    $selection
}
