rule  Dev_sigma_windows_defender_malware_detection_history_deletion {
 meta:
    author = "Cian Heasley"
    description = "Windows Defender logs when the history of detected infections is deleted. Log file will contain the message \"Windows Defender Antivirus has removed history of malware and other potentially unwanted software\". Author: Cian Heasley."
    reference = ""
    version = "0.01"
    created = "2020/08/13"
    category = "windows"
    product = "windef"
    mitre = "defense_evasion, t1070.001"

  events:
($selection.metadata.product_event_type = "1013" and $selection.metadata.event_type = "4")

  condition:
    $selection
}
