rule  Dev_sigma_suspicous_remote_logon_with_explicit_credentials {
 meta:
    author = "oscd.community, Teymur Kheirkhabarov @HeirhabarovT, Zach Stanford @svch0st"
    description = "Detects suspicious processes logging on with explicit credentials Author: oscd.community, Teymur Kheirkhabarov @HeirhabarovT, Zach Stanford @svch0st."
    reference = ""
    version = "0.01"
    created = "2020/10/05"
    product = "windows"
    service = "security"
    mitre = "t1078, lateral_movement"

  events:
(($selection.metadata.product_event_type = "4648" and (re.regex($selection.target.process.file.full_path, `.*\\cmd\.exe`) or re.regex($selection.target.process.file.full_path, `.*\\powershell\.exe`) or re.regex($selection.target.process.file.full_path, `.*\\pwsh\.exe`) or re.regex($selection.target.process.file.full_path, `.*\\winrs\.exe`) or re.regex($selection.target.process.file.full_path, `.*\\wmic\.exe`) or re.regex($selection.target.process.file.full_path, `.*\\net\.exe`) or re.regex($selection.target.process.file.full_path, `.*\\net1\.exe`) or re.regex($selection.target.process.file.full_path, `.*\\reg\.exe`))) and not ($selection.Target_Server_Name = "localhost"))

  condition:
    $selection
}
