rule  Dev_sigma_gallium_artefacts {
 meta:
    author = "Tim Burrell"
    description = "Detects artefacts associated with activity group GALLIUM - Microsoft Threat Intelligence Center indicators released in December 2019. Author: Tim Burrell."
    reference = ""
    version = "0.01"
    created = "2020/02/07"
    product = "windows"
    category = "process_creation"
    mitre = "credential_access, command_and_control"

  events:
($exec_selection.sha1 = "53a44c2396d15c3a03723fa5e5db54cafd527635" or $exec_selection.sha1 = "9c5e496921e3bc882dc40694f1dcc3746a75db19" or $exec_selection.sha1 = "aeb573accfd95758550cf30bf04f389a92922844" or $exec_selection.sha1 = "79ef78a797403a4ed1a616c68e07fff868a8650a" or $exec_selection.sha1 = "4f6f38b4cec35e895d91c052b1f5a83d665c2196" or $exec_selection.sha1 = "1e8c2cac2e4ce7cbd33c3858eb2e24531cb8a84d" or $exec_selection.sha1 = "e841a63e47361a572db9a7334af459ddca11347a" or $exec_selection.sha1 = "c28f606df28a9bc8df75a4d5e5837fc5522dd34d" or $exec_selection.sha1 = "2e94b305d6812a9f96e6781c888e48c7fb157b6b" or $exec_selection.sha1 = "dd44133716b8a241957b912fa6a02efde3ce3025" or $exec_selection.sha1 = "8793bf166cb89eb55f0593404e4e933ab605e803" or $exec_selection.sha1 = "a39b57032dbb2335499a51e13470a7cd5d86b138" or $exec_selection.sha1 = "41cc2b15c662bc001c0eb92f6cc222934f0beeea" or $exec_selection.sha1 = "d209430d6af54792371174e70e27dd11d3def7a7" or $exec_selection.sha1 = "1c6452026c56efd2c94cea7e0f671eb55515edb0" or $exec_selection.sha1 = "c6b41d3afdcdcaf9f442bbe772f5da871801fd5a" or $exec_selection.sha1 = "4923d460e22fbbf165bbbaba168e5a46b8157d9f" or $exec_selection.sha1 = "f201504bd96e81d0d350c3a8332593ee1c9e09de" or $exec_selection.sha1 = "ddd2db1127632a2a52943a2fe516a2e7d05d70d2")

  condition:
    $exec_selection
}
rule  Dev_sigma_gallium_artefacts_part_1 {
 meta:
    author = "Tim Burrell"
    description = "Detects artefacts associated with activity group GALLIUM - Microsoft Threat Intelligence Center indicators released in December 2019. Author: Tim Burrell."
    reference = ""
    version = "0.01"
    created = "2020/02/07"
    product = "windows"
    service = "dns-server"
    mitre = "credential_access, command_and_control"

  events:
($c2_selection.metadata.product_event_type = "257" and ($c2_selection.QNAME = "asyspy256.ddns.net" or $c2_selection.QNAME = "hotkillmail9sddcc.ddns.net" or $c2_selection.QNAME = "rosaf112.ddns.net" or $c2_selection.QNAME = "cvdfhjh1231.myftp.biz" or $c2_selection.QNAME = "sz2016rose.ddns.net" or $c2_selection.QNAME = "dffwescwer4325.myftp.biz" or $c2_selection.QNAME = "cvdfhjh1231.ddns.net"))

  condition:
    $c2_selection
}
rule  Dev_sigma_gallium_artefacts_part_2 {
 meta:
    author = "Tim Burrell"
    description = "Detects artefacts associated with activity group GALLIUM - Microsoft Threat Intelligence Center indicators released in December 2019. Author: Tim Burrell."
    reference = ""
    version = "0.01"
    created = "2020/02/07"
    product = "windows"
    category = "process_creation"
    mitre = "credential_access, command_and_control"

  events:
($legitimate_process_path.sha1 = "e570585edc69f9074cb5e8a790708336bd45ca0f" and not ((re.regex($legitimate_process_path.target.process.file.full_path, `.*:\\Program Files\(x86\)\\.*`) or re.regex($legitimate_process_path.target.process.file.full_path, `.*:\\Program Files\\.*`))))

  condition:
    $legitimate_process_path
}
