rule  Dev_sigma_malicious_powershell_commandlets {
 meta:
    author = "Sean Metcalf (source), Florian Roth (rule), Bartlomiej Czyz @bczyz1 (update), oscd.community (update)"
    description = "Detects Commandlet names from well-known PowerShell exploitation frameworks Author: Sean Metcalf (source), Florian Roth (rule), Bartlomiej Czyz @bczyz1 (update), oscd.community (update)."
    reference = ""
    version = "0.01"
    created = "2017/03/05"
    product = "windows"
    service = "powershell"
    mitre = "execution, t1059.001, t1086"

  events:
(($false_positives.metadata.product_event_type = "4104" and (re.regex($false_positives.target.process.command_line, `.*Invoke-DllInjection.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-Shellcode.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-WmiCommand.*`) or re.regex($false_positives.target.process.command_line, `.*Get-GPPPassword.*`) or re.regex($false_positives.target.process.command_line, `.*Get-Keystrokes.*`) or re.regex($false_positives.target.process.command_line, `.*Get-TimedScreenshot.*`) or re.regex($false_positives.target.process.command_line, `.*Get-VaultCredential.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-CredentialInjection.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-Mimikatz.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-NinjaCopy.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-TokenManipulation.*`) or re.regex($false_positives.target.process.command_line, `.*Out-Minidump.*`) or re.regex($false_positives.target.process.command_line, `.*VolumeShadowCopyTools.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-ReflectivePEInjection.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-UserHunter.*`) or re.regex($false_positives.target.process.command_line, `.*Find-GPOLocation.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-ACLScanner.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-DowngradeAccount.*`) or re.regex($false_positives.target.process.command_line, `.*Get-ServiceUnquoted.*`) or re.regex($false_positives.target.process.command_line, `.*Get-ServiceFilePermission.*`) or re.regex($false_positives.target.process.command_line, `.*Get-ServicePermission.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-ServiceAbuse.*`) or re.regex($false_positives.target.process.command_line, `.*Install-ServiceBinary.*`) or re.regex($false_positives.target.process.command_line, `.*Get-RegAutoLogon.*`) or re.regex($false_positives.target.process.command_line, `.*Get-VulnAutoRun.*`) or re.regex($false_positives.target.process.command_line, `.*Get-VulnSchTask.*`) or re.regex($false_positives.target.process.command_line, `.*Get-UnattendedInstallFile.*`) or re.regex($false_positives.target.process.command_line, `.*Get-ApplicationHost.*`) or re.regex($false_positives.target.process.command_line, `.*Get-RegAlwaysInstallElevated.*`) or re.regex($false_positives.target.process.command_line, `.*Get-Unconstrained.*`) or re.regex($false_positives.target.process.command_line, `.*Add-RegBackdoor.*`) or re.regex($false_positives.target.process.command_line, `.*Add-ScrnSaveBackdoor.*`) or re.regex($false_positives.target.process.command_line, `.*Gupt-Backdoor.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-ADSBackdoor.*`) or re.regex($false_positives.target.process.command_line, `.*Enabled-DuplicateToken.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-PsUaCme.*`) or re.regex($false_positives.target.process.command_line, `.*Remove-Update.*`) or re.regex($false_positives.target.process.command_line, `.*Check-VM.*`) or re.regex($false_positives.target.process.command_line, `.*Get-LSASecret.*`) or re.regex($false_positives.target.process.command_line, `.*Get-PassHashes.*`) or re.regex($false_positives.target.process.command_line, `.*Show-TargetScreen.*`) or re.regex($false_positives.target.process.command_line, `.*Port-Scan.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-PoshRatHttp.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-PowerShellTCP.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-PowerShellWMI.*`) or re.regex($false_positives.target.process.command_line, `.*Add-Exfiltration.*`) or re.regex($false_positives.target.process.command_line, `.*Add-Persistence.*`) or re.regex($false_positives.target.process.command_line, `.*Do-Exfiltration.*`) or re.regex($false_positives.target.process.command_line, `.*Start-CaptureServer.*`) or re.regex($false_positives.target.process.command_line, `.*Get-ChromeDump.*`) or re.regex($false_positives.target.process.command_line, `.*Get-ClipboardContents.*`) or re.regex($false_positives.target.process.command_line, `.*Get-FoxDump.*`) or re.regex($false_positives.target.process.command_line, `.*Get-IndexedItem.*`) or re.regex($false_positives.target.process.command_line, `.*Get-Screenshot.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-Inveigh.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-NetRipper.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-EgressCheck.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-PostExfil.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-PSInject.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-RunAs.*`) or re.regex($false_positives.target.process.command_line, `.*MailRaider.*`) or re.regex($false_positives.target.process.command_line, `.*New-HoneyHash.*`) or re.regex($false_positives.target.process.command_line, `.*Set-MacAttribute.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-DCSync.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-PowerDump.*`) or re.regex($false_positives.target.process.command_line, `.*Exploit-Jboss.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-ThunderStruck.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-VoiceTroll.*`) or re.regex($false_positives.target.process.command_line, `.*Set-Wallpaper.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-InveighRelay.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-PsExec.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-SSHCommand.*`) or re.regex($false_positives.target.process.command_line, `.*Get-SecurityPackages.*`) or re.regex($false_positives.target.process.command_line, `.*Install-SSP.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-BackdoorLNK.*`) or re.regex($false_positives.target.process.command_line, `.*PowerBreach.*`) or re.regex($false_positives.target.process.command_line, `.*Get-SiteListPassword.*`) or re.regex($false_positives.target.process.command_line, `.*Get-System.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-BypassUAC.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-Tater.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-WScriptBypassUAC.*`) or re.regex($false_positives.target.process.command_line, `.*PowerUp.*`) or re.regex($false_positives.target.process.command_line, `.*PowerView.*`) or re.regex($false_positives.target.process.command_line, `.*Get-RickAstley.*`) or re.regex($false_positives.target.process.command_line, `.*Find-Fruit.*`) or re.regex($false_positives.target.process.command_line, `.*HTTP-Login.*`) or re.regex($false_positives.target.process.command_line, `.*Find-TrustedDocuments.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-Paranoia.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-WinEnum.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-ARPScan.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-PortScan.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-ReverseDNSLookup.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-SMBScanner.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-Mimikittenz.*`) or re.regex($false_positives.target.process.command_line, `.*Invoke-AllChecks.*`))) and not ($false_positives.metadata.product_event_type = "4104" and re.regex($false_positives.target.process.command_line, `.*Get-SystemDriveInfo.*`)))

  condition:
    $false_positives
}
