rule  Dev_sigma_eventlog_cleared {
 meta:
    author = "Florian Roth"
    description = "One of the Windows Eventlogs has been cleared. e.g. caused by \"wevtutil cl\" command execution Author: Florian Roth."
    reference = ""
    version = "0.01"
    created = "2017/01/10"
    product = "windows"
    mitre = "defense_evasion, t1070, t1070.001, car.2016-04-002"

  events:
(($selection1.service = "security" and ($selection1.metadata.product_event_type = "517" or $selection1.metadata.product_event_type = "1102")) or ($selection1.service = "system" and $selection1.metadata.product_event_type = "104" and $selection1.src.application = "Microsoft-Windows-Eventlog"))

  condition:
    $selection1
}
