rule  Dev_sigma_suspicious_outbound_kerberos_connection {
 meta:
    author = "Ilyas Ochkov, oscd.community"
    description = "Detects suspicious outbound network activity via kerberos default port indicating possible lateral movement or first stage PrivEsc via delegation. Author: Ilyas Ochkov, oscd.community."
    reference = ""
    version = "0.01"
    created = "2019/10/24"
    product = "windows"
    service = "security"
    mitre = "lateral_movement, t1208, t1558.003"

  events:
(($selection.metadata.product_event_type = "5156" and $selection.target.port = "88") and not ((re.regex($selection.target.process.file.full_path, `.*\\lsass\.exe`) or re.regex($selection.target.process.file.full_path, `.*\\opera\.exe`) or re.regex($selection.target.process.file.full_path, `.*\\chrome\.exe`) or re.regex($selection.target.process.file.full_path, `.*\\firefox\.exe`))))

  condition:
    $selection
}
