rule  Dev_sigma_defrag_deactivation {
 meta:
    author = "Florian Roth, Bartlomiej Czyz (@bczyz1)"
    description = "Detects the deactivation and disabling of the Scheduled defragmentation task as seen by Slingshot APT group Author: Florian Roth, Bartlomiej Czyz (@bczyz1)."
    reference = ""
    version = "0.01"
    created = "2019/03/04"
    category = "process_creation"
    product = "windows"
    mitre = "persistence, s0111"

  events:
(re.regex($selection1.target.process.file.full_path, `.*\\schtasks\.exe`) and (re.regex($selection1.target.process.command_line, `.*/delete.*`) or re.regex($selection1.target.process.command_line, `.*/change.*`)) and re.regex($selection1.target.process.command_line, `.*/TN.*`) and re.regex($selection1.target.process.command_line, `.*\\Microsoft\\Windows\\Defrag\\ScheduledDefrag.*`))

  condition:
    $selection1
}
rule  Dev_sigma_defrag_deactivation_part_1 {
 meta:
    author = "Florian Roth, Bartlomiej Czyz (@bczyz1)"
    description = "Detects the deactivation and disabling of the Scheduled defragmentation task as seen by Slingshot APT group Author: Florian Roth, Bartlomiej Czyz (@bczyz1)."
    reference = ""
    version = "0.01"
    created = "2019/03/04"
    product = "windows"
    service = "security"
    mitre = "persistence, s0111"

  events:
($selection3.metadata.product_event_type = "4701" and $selection3.target.resource.name = "Microsoft\\Windows\\Defrag\\ScheduledDefrag")

  condition:
    $selection3
}
